notes/meeting_2021apr11.org
* meeting notes Apr 11, 2021
** rough plan
*** ask about questions, ideas, discussion topics
*** recap of grammar to parse doomfiles: yary hluchan's approach, "decision points"
*** stackoverflow question by william michels "dualvars"
**** https://stackoverflow.com/questions/66926663/is-there-a-convenient-way-to-replicate-rs-concept-of-named-vectors-in-raku-p
*** salve j. nilsen: conversation about idiomatic raku
**** hidden agenda (aha): understandability (not quite "readability", condescending)
programs written as literary works
http://www.quotationspage.com/quote/24934.html
*** accuracy equivalency of large numbers (mailing list)
**** https://www.nntp.perl.org/group/perl.perl6.users/2021/04/msg9860.html


** future topics, mixins mixed up
https://github.com/rakudo/rakudo/issues/4282
