notes/meeting_2021apr11.md
- [meeting notes Apr 11, 2021](#org63ccc6b)
  - [rough plan](#org73789d9)
    - [ask about questions, ideas, discussion topics](#orgd80e8f2)
    - [recap of grammar to parse doomfiles: yary hluchan's approach, "decision points"](#org38eac33)
    - [stackoverflow question by william michels "dualvars"](#orgbdf671d)
    - [salve j. nilsen: conversation about idiomatic raku](#org1f2f440)
    - [accuracy equivalency of large numbers (mailing list)](#org551c702)
  - [future topics, mixins mixed up](#orge425376)


<a id="org63ccc6b"></a>

# meeting notes Apr 11, 2021


<a id="org73789d9"></a>

## rough plan


<a id="orgd80e8f2"></a>

### ask about questions, ideas, discussion topics


<a id="org38eac33"></a>

### recap of grammar to parse doomfiles: yary hluchan's approach, "decision points"


<a id="orgbdf671d"></a>

### stackoverflow question by william michels "dualvars"

1.  <https://stackoverflow.com/questions/66926663/is-there-a-convenient-way-to-replicate-rs-concept-of-named-vectors-in-raku-p>


<a id="org1f2f440"></a>

### salve j. nilsen: conversation about idiomatic raku

1.  hidden agenda (aha): understandability (not quite "readability", condescending)

    programs written as literary works <http://www.quotationspage.com/quote/24934.html>


<a id="org551c702"></a>

### accuracy equivalency of large numbers (mailing list)

1.  <https://www.nntp.perl.org/group/perl.perl6.users/2021/04/msg9860.html>


<a id="orge425376"></a>

## future topics, mixins mixed up

<https://github.com/rakudo/rakudo/issues/4282>
